//Первое Задание 2й лекции

/*int numberA = 3; 
int numberB = 8;
int result = (numberA + numberB); //Мы так же можем выдать конечное значение не использую промежуточный подчёт.
// то есть int result = (numberA + numberB) является не обязательным условием
Console.WriteLine (result);
*/
//------------------------------------------------------------------------------------------------------------------------//

//Второе задание 2й лекции 
int name (int arg1, int arg2, int arg3,); //Тут мы пишем Некоторые Аргументы для сравнения чисел между собой
{
    int result = arg1; 
    int (arg2 > result) result = arg2;
    int (arg3 > result) result = arg3; 

}


int a = 12; 
int b = 32; 
int d = 83334;
int e = 732;
int g = 8333;



/*int max = a; //Опеределяем максимум первого Аргумента.
if (a > max) max = a; // Если A больше максимального чилас то, Максимальны числом становиться то число которые сравнивалось с первым Масимумом.
if (b > max) max = b;  // и так сравнивается каждое числа с предыдущим до тех пор пока не будет найден максимум.
if (d > max) max = d; //что бы не писать такой большой код для сравнивания чисел, достаточно сравнить лидеров из всех групп для выявления наибольшего числа
if (e > max) max = e; 
if (g > max) max = g;
*/


Console.WriteLine (max);


