
 /*Эти 2 слеша помогают закомментировать любой текс или же строчки кода которые будут находиться в них //Всё что не нужно можно записать после слешей или же целиком 
 /*путём таких вот скобочек 


Console.WriteLine("Hello world"); - эта программа позволяет выводить текст на экран.
string - строка.
Комманда WriteLine позволяет выводить текст на разных уровнях с нашими вводимыми данными. На пример

string username = Console.ReadLine();
Console.WriteLine ("Привет, ");
Console.WriteLine (username);

Ответ будет такой:
1. Введите Имя
2. Привет 
3. Имя пользователя


Так же мы можем ввести комманду Console.Write(); и тогда комманда выполниться без переноса
наших слов на новую строчку. Пример:*/

string username = Console.Write();
Console.Write ("Привет, ");
Console.Write (username);

/*Ответ будет такой
1. Введите Имя
2. Привет Имя пользователя.



 Есть несколько типов данных
1. int - позволяет хранить целые числа 
2. dooble - позволяет хранить дробные числа.
3. string - этот тип данных позволяет хранить строчки. но так же он может не иметь данных и вовсе.
4. bool - логический тип данных не может хранить ни числа не символы, этот тип данных Хранит всего 2 значения
4.1 True - истинна
4.2. False - Ложь

 
Так же есть множество типов данных таких как 

1. +  плюс
2. - минус
3. / деление
4. * умножение
5. % нахождение остатка от деления
6. () - скобки позволяют менять приоритет оппераций.


 Так же если мы хотим составить алгоритм из множество переменных случайных чисел мы можем ввести*/
 
